johnnyeatworld89/stm32l152-led-test/Libraries/ST7735/st7735.h
#ifndef ST7735_H
#define ST7735_H

#include "stm32l1xx_hal.h"


/* -------------------------------------------------------------------------- */
/* Display dimensions                                                         */
/* -------------------------------------------------------------------------- */

#define ST7735_WIDTH   128
#define ST7735_HEIGHT  160


/* -------------------------------------------------------------------------- */
/* Display offsets                                                            */
/* -------------------------------------------------------------------------- */

/*
 * Native panel offsets for the 128 x 160 ST7735S panel.
 *
 * The active X/Y offsets are selected by ST7735_SetRotation().
 */
#define ST7735_COLSTART  2
#define ST7735_ROWSTART  1


/* -------------------------------------------------------------------------- */
/* RGB565 colors                                                              */
/* -------------------------------------------------------------------------- */

#define ST7735_BLACK   0x0000
#define ST7735_BLUE    0x001F
#define ST7735_RED     0xF800
#define ST7735_GREEN   0x07E0
#define ST7735_WHITE   0xFFFF
#define ST7735_YELLOW  0xFFE0
#define ST7735_CYAN    0x07FF
#define ST7735_MAGENTA 0xF81F


/* -------------------------------------------------------------------------- */
/* SPI handle                                                                 */
/* -------------------------------------------------------------------------- */

extern SPI_HandleTypeDef hspi1;


/* -------------------------------------------------------------------------- */
/* Initialization                                                             */
/* -------------------------------------------------------------------------- */

void ST7735_Init(void);

void ST7735_SetRotation(uint8_t rotation);


/* -------------------------------------------------------------------------- */
/* Basic drawing                                                              */
/* -------------------------------------------------------------------------- */

void ST7735_DrawPixel(
    uint16_t x,
    uint16_t y,
    uint16_t color
);

void ST7735_FillScreen(
    uint16_t color
);


/* -------------------------------------------------------------------------- */
/* Lines                                                                      */
/* -------------------------------------------------------------------------- */

void ST7735_DrawLine(
    int16_t x0,
    int16_t y0,
    int16_t x1,
    int16_t y1,
    uint16_t color
);


/* -------------------------------------------------------------------------- */
/* Rectangles                                                                 */
/* -------------------------------------------------------------------------- */

void ST7735_DrawRect(
    uint16_t x,
    uint16_t y,
    uint16_t width,
    uint16_t height,
    uint16_t color
);

void ST7735_FillRect(
    uint16_t x,
    uint16_t y,
    uint16_t width,
    uint16_t height,
    uint16_t color
);


/* -------------------------------------------------------------------------- */
/* Arrows                                                                     */
/* -------------------------------------------------------------------------- */

void ST7735_DrawArrow(
    int16_t x0,
    int16_t y0,
    int16_t x1,
    int16_t y1,
    uint16_t color
);


#endif
